{
    "personal": {
        "name": "Zakaria TOZY",
        "title": "Data Engineer | CDI",
        "contract": "CDI",
        "phone": "0617407077",
        "email": "zakaria.tozy@icloud.com",
        "linkedin": "zakaria-tozy",
        "github": "zack242",
        "location": "Paris",
        "summary": "Jeune ingénieur diplômé d'un double cursus en systèmes d'information et data science, avec une forte passion pour la data, l'IA et les nouvelles technologies. Je resors fort d'une expérience en tant que Data Engineer / Data analyst au sein de AXA IM, et je suis à la recherche d'un CDI pour mettre en pratiques mes competences."
    },
    "skills": {
        "programmation": [
            "Python",
            "SQL",
            "Java",
            "JavaScript"
        ],
        "data_engineering": [
            "PySpark",
            "Databricks,Snowflake",
            "Azure,GCP,S3",
            "dbt"
        ],
        "machine_learning": [
            "Scikit-Learn",
            "Pandas",
            "Numpy",
            "NLP",
            "LLM"
        ],
        "devops": [
            "Docker",
            "CI/CD",
            "Git"
        ],
        "soft_skills": [
            "Autonome",
            "Rigoureux",
            "Esprit d'analyse",
            "Apprentissage rapide"
        ],
        "langues": [
            "Français (Bilingue)",
            "Arabe (Bilingue)",
            "Anglais (Courant - TOEIC 875)"
        ]
    },
    "education": [
        {
            "school": "École Centrale d'Électronique (ECE Paris)",
            "degree": "Ingénieur en Systèmes d'Information et Big Data Analytics",
            "date": "Janvier 2024",
            "distinction": "Top 5% de la promotion",
            "specialization": "Spécialisation : Programmation, Bases de données, Électronique"
        },
        {
            "school": "Institut Polytechnique de Paris (École Polytechnique)",
            "degree": "Master 2 en Data Sciences",
            "date": "Janvier 2024",
            "distinction": "Mention Très bien",
            "specialization": "Spécialisation : Machine Learning, Big Data, Cloud Infrastructure, Deep Learning, NLP"
        }
    ],
    "experience": [
        {
            "company": "Projet Personnel",
            "position": "Ingénieur Blockchain - Dévellopement d'un sniper bot en Rust",
            "dates": "Février 2024 -- Juin 2024",
            "highlights": [
                "Monitoring de tous les tokens créés sur la blockchain Solana",
                "Mise en place d'un système pour acheter ces tokens dès leur création en moins de 1s",
                "Vente automatique des tokens après réalisation d'une plus-value"
            ]
        },
        {
            "company": "AXA Investment Managers - AXA IM",
            "position": "Stage de Fin d'Études - Data Engineer / Data Analyst",
            "dates": "Août 2023 -- Janvier 2024",
            "highlights": [
                "Conception et mise en place de pipelines de données pour l'ingestion et la gestion des données métiers",
                "Optimisation du modèle de données et migration des pipelines de distribution pour le reporting financier de 844 milliards d'euros d'actifs",
                "Tests de nouveaux clusters Databricks et création d'un PoC pour l'anonymisation des données sensibles",
                "Création de tableaux de bord et calcul des KPIs pour la vision distribuée (ME, OV, CIS, FX)"
            ]
        },
        {
            "company": "Kalima Blockchain et IoT",
            "position": "Stage - Software Engineer",
            "dates": "Avril 2022 -- Août 2022",
            "highlights": [
                "Développement d'un explorateur de blockchain propriétaire Kalima en Java/LevelDB (+1000 transactions par seconde)",
                "Implémentation de nouvelles fonctionnalités d'administration pour la blockchain propriétaire Kalima en Node.js",
                "Conception et développement d'un système d'authentification multisignature pour les DApps (Decentralized Applications)"
            ]
        },
        {
            "company": "Le Crédit Lyonnais - LCL",
            "position": "Stage - IT Support",
            "dates": "Janvier 2020 -- Février 2020",
            "highlights": [
                "Étude de migration Microsoft Office 2010 vers 2016 et analyse de son impact sur les processus métiers",
                "Développement et exécution de procédures de tests sur un parc de 23 000 postes de travail"
            ]
        }
    ],
    "projects": [
        {
            "name": "Bitcoin Analysis",
            "date": "Août 2024",
            "highlights": [
                "Création d'un pipeline de données avec Python, SQL, Airflow, dbt et Snowflake pour l'analyse des transactions Bitcoin, traitant plus de 1 million de transactions par jour."
            ]
        },
        {
            "name": "Twitter Real-time Analysis",
            "date": "Avril 2023",
            "highlights": [
                "Développement d'un système de visualisation en temps réel des flux Twitter par sujets à l'aide de Kafka et de l'algorithme KNN (K-Nearest Neighbors)."
            ]
        },
        {
            "name": "Agent AI Autonome",
            "date": "Novembre 2024",
            "highlights": [
                "Développement d'un agent AI autonome utilisant le framework ai16z",
                "Deploiment de l'agent ai sur Twitter dans le but d'interagir avec les utilisateurs",
                "Utilisation de l'api de open ai pour la génération de réponses"
            ]
        }
    ]
}